<?php
/*
 * 办公助手配置文件
 * 最后更新: 2025-08-23
 */
 /*==============================================
 *                您的数据库配置
 *==============================================*/
$db_config = [
    'host' => '127.0.0.1',
    'port' => 3306,
    'user' => '29_colnt_com',
    'password' => 'ifMezaaH5FEP31Z8',
    'db' => '29_colnt_com',
    'charset' => 'utf8mb4'
];
// API基础配置
$api_url = "网址"; // 你要对接的平台地址
$uid = '你的UID';       // 你的UID
$key = '你的KEY';      // 你的KEY注意不要有空格
/*==============================================
 *                盖章服务配置
 *==============================================*/
$jg = 2; // 盖章价格倍数
$hid    = 0;  // 盖章平台ID
/*==============================================
 *                病历服务配置
 *==============================================*/
$bljg = 2; // 病历价格倍数
$blhid    = 0;  // 病历平台ID
/*==============================================
 *                其他配置(切勿变动)
 *==============================================*/
$redis_password = ''; // Redis密码，如果没有则留空,默认为空不要乱改
$redis_db_index = 0;  // Redis数据库索引，不懂就默认，不要乱改！
$enable_auto_submit  = true;
$enable_bl_progress_check = true;
$enable_company_order_submit = true;

/*==============================================
 *                安全校验
 *==============================================*/
if (basename(__FILE__) == basename($_SERVER["SCRIPT_FILENAME"])) {
    die("办公助手提醒您: 配置文件禁止直接访问！");
}
?>
